trunk/Document/Report/Tuan18/thanh qua/projectNetbean/demoCallEJBModule/caLoanApplication/src/jbiServiceUnits/META-INF/bpLoanApplication/src/_references/_projects/ejbLoanProcessor/src/java/contract/loanProcessor.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="loanProcessor" targetNamespace="http://j2ee.netbeans.org/wsdl/ejbLoanProcessor/loanProcessor"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/ejbLoanProcessor/loanProcessor" xmlns:ns0="http://demo.sun.com/openesb/types/LoanResponseMsg" xmlns:ns="http://demo.sun.com/openesb/types/LoanRequestMsg" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/ejbLoanProcessor/loanProcessor">
            <xsd:import namespace="http://demo.sun.com/openesb/types/LoanResponseMsg" schemaLocation="LoanResponseMsg.xsd"/>
            <xsd:import namespace="http://demo.sun.com/openesb/types/LoanRequestMsg" schemaLocation="LoanRequestMsg.xsd"/>
        </xsd:schema>
    </types>
    <message name="processLoanRequest">
        <part name="processorInput" element="ns:loanRequestMsg"/>
    </message>
    <message name="processLoanResponse">
        <part name="processorOutput" element="ns0:loanResponseMsg"/>
    </message>
    <portType name="loanProcessorPortType">
        <operation name="processLoan">
            <input name="input1" message="tns:processLoanRequest"/>
            <output name="output1" message="tns:processLoanResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="loanProcessor">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="loanProcessorPortTypeRole" portType="tns:loanProcessorPortType"/>
    </plnk:partnerLinkType>
</definitions>

