trunk/Document/Report/Tuan18/thanh qua/projectNetbean/demoCallEJBModule/caLoanApplication/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loan="http://demo.sun.com/openesb/types/LoanRequestMsg">
  <soapenv:Body>
    <loan:loanRequestMsg>
      <loan:socialSecurityNumber>343</loan:socialSecurityNumber>
      <loan:applicantName>ewwe</loan:applicantName>
      <loan:applicantAddress>34</loan:applicantAddress>
      <loan:applicantEmailAddress>erwr</loan:applicantEmailAddress>
      <loan:applicantAge>23</loan:applicantAge>
      <loan:applicantGender>erewrwr</loan:applicantGender>
      <loan:annualSalary>111</loan:annualSalary>
      <loan:amountRequested>33</loan:amountRequested>
    </loan:loanRequestMsg>
  </soapenv:Body>
</soapenv:Envelope>