trunk/Document/Report/Tuan18/thanh qua/projectNetbean/demoCallEJBModule/caLoanApplication/test/happyCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loan="http://demo.sun.com/openesb/types/LoanRequestMsg">
  <soapenv:Body>
    <loan:loanRequestMsg>
      <loan:socialSecurityNumber>123</loan:socialSecurityNumber>
      <loan:applicantName>bob</loan:applicantName>
      <loan:applicantAddress>oslo</loan:applicantAddress>
      <loan:applicantEmailAddress>bob@home</loan:applicantEmailAddress>
      <loan:applicantAge>12</loan:applicantAge>
      <loan:applicantGender>m</loan:applicantGender>
      <loan:annualSalary>1111111</loan:annualSalary>
      <loan:amountRequested>222</loan:amountRequested>
    </loan:loanRequestMsg>
  </soapenv:Body>
</soapenv:Envelope>